<template>
  <div class="m-menu">
    <dl class="nav" @mouseleave="menuLeave">
      <dt>全部分类</dt>
      <dd
        v-for="(item, index) in menuList"
        :key="index"
        @mouseenter="menuEnter(item)"
      >
        <i :class="item.type"></i>
        {{ item.name }}
        <span class="arrow"></span>
      </dd>
    </dl>
    <div
      v-if="curDetail"
      class="detail"
      @mouseenter="detailEnter"
      @mouseleave="detailLeave"
    >
      <template v-for="(item, index) in curDetail.items">
        <h4 :key="index">{{ item.title }}</h4>
        <span v-for="(v, i) in item.items" :key="index + '_' + i">{{ v }}</span>
      </template>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      curDetail: null,
      menuList: [
        {
          type: "food",
          name: "女装 /内衣",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "女鞋 /男鞋 /箱包",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "hotel",
          name: "美妆 /个人护理",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "food",
          name: "腕表 /眼镜 /珠宝饰品",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "手机 /数码 /电脑办公",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "hotel",
          name: "零食 /茶酒 /进口食品",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "food",
          name: "生鲜水果",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "大家电 /生活电器",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "hotel",
          name: "家具建材",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "food",
          name: "汽车 /配件 /用品",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "家纺 /家饰 /鲜花",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "hotel",
          name: "医药保健",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "food",
          name: "厨具 /收纳 /宠物",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "图书音像",
          items: [
            {
              title: "当季流行",
              items: [
                "女装新品",
                "商场同款",
                "仙女连衣裙",
                "T恤",
                "衬衫",
                "女装新品",
                "时髦外套",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "精选上装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "浪漫裙装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            },
            {
              title: "女士下装",
              items: [
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐",
                "女装新品",
                "甜点饮品",
                "火锅",
                "自助餐",
                "小吃快餐"
              ]
            }
          ]
        }
      ]
    };
  },
  methods: {
    menuEnter(item) {
      this.curDetail = item;
    },
    menuLeave() {
      var self = this;
      this.timer = setTimeout(function() {
        self.curDetail = null;
      }, 200);
    },
    detailEnter() {
      clearTimeout(this.timer);
    },
    detailLeave() {
      this.curDetail = null;
    }
  }
};
</script>

<style lang="scss" scoped>
.m-menu {
  width: 230px;
  height: 546px;
  box-sizing: border-box;
  margin-top: -50px;
  margin-left: 20px;
  color: #fff;
  position: relative;
  background-color: rgba(0, 0, 0, 0.55);
  dt {
    height: 46px;
    line-height: 46px;
    // padding-top: 15px;
    box-sizing: border-box;
    font-size: 16px;
    font-weight: 400;
    // margin-left: 15px;
    // margin-bottom: 8px;
    text-align: center;
    background-color: #f00;
  }

  dd {
    position: relative;
    box-sizing: border-box;
    padding: 2px 12px;
    height: 35px;
    line-height: 35px;
    cursor: pointer;

    &:hover {
      background: rgba(255, 255, 255, 0.2);

      & > i {
        opacity: 1;
      }
    }
  }

  .nav {
    font-size: 13px;
    dd > i {
      font-family: "meituan";
      font-size: 14px;
      font-style: normal;
      opacity: 0.3;
      margin-right: 11px;

      &:before {
        width: 14px;
        height: 14px;
        display: inline-block;
      }
    }

    .food {
      &:before {
        content: "\e622";
      }
    }

    .takeout {
      &:before {
        content: "\e630";
      }
    }

    .hotel {
      &:before {
        content: "\e62a";
      }
    }

    .homestay {
      &:before {
        content: "\e631";
      }
    }

    .movie {
      &:before {
        content: "\e62c";
        position: relative;
        left: -2px;
      }
    }

    .airport {
      &:before {
        content: "\e632";
      }
    }

    .ktv {
      &:before {
        content: "\e627";
      }
    }

    .life {
      &:before {
        content: "\e633";
      }
    }

    .hair {
      &:before {
        content: "\e626";
        transform: scale(0.7);
      }
    }

    .marry {
      &:before {
        content: "\e629";
      }
    }

    .offspring {
      &:before {
        content: "\e623";
      }
    }

    .sport {
      &:before {
        content: "\e62b";
      }
    }

    .furniture {
      &:before {
        content: "\e625";
      }
    }

    .study {
      &:before {
        content: "\e624";
      }
    }

    .health {
      &:before {
        content: "\e628";
      }
    }

    .bar {
      &:before {
        content: "\e621";
      }
    }

    .arrow {
      width: 4px;
      height: 4px;
      border-bottom: 1px solid #fff;
      border-right: 1px solid #fff;
      transform: rotate(-45deg);
      display: block;
      position: absolute;
      right: 13px;
      top: 0;
      bottom: 0;
      margin: auto;
    }
  }

  .detail {
    padding: 0 30px;
    position: absolute;
    left: 230px;
    top: 46px;
    width: 500px;
    height: 500px;
    background: #fff;
    z-index: 9999;

    h4 {
      font-size: 16px;
      font-weight: 500;
      margin-top: 24px;
      height: 22px;
      line-height: 22px;
      padding-bottom: 10px;
      border-bottom: 1px solid #e5e5e5;
      color: #222;
    }

    span {
      color: #999;
      font-size: 12px;
      line-height: 15px;
      display: inline-block;
      margin-right: 16px;
      margin-top: 10px;
      cursor: pointer;

      &:hover {
        color: #31bbac;
      }
    }
  }
}
</style>
